#include <iostream>
#include <clocale>
using namespace std;
int main ()
{
    setlocale(LC_ALL, "Russian");
    int a = 5, b = 5;
    int c = ++a;
    int d = b++;
    cout << "Значение a: " << a << '\n';
    cout << "Значение b: " << b << '\n';
    cout << "Значение c: " << c << '\n';
    cout << "Значение d: " << d << '\n';
  /*Префиксный инкримент ++a:
    1. увеличивает a
    2. возвращает уже увеличенное значение
    Постфиксный инкримент b++:
    1. сохраняет старое значение
    2. увеличивает b
    3. возвращает старое значение
    Разница в экономии памяти на больших числах она будет существенна
    Разница в скорости выполнении программы, также на больших числах она будет существенна
    */

return 0;
}

